Masmiseim36/nxpSDK/boards/twrk65f180m/demo_apps/sai_peripheral/pin_mux.h
/*
 * Copyright 2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTE16 (coord H3), J33[2]/U5[4]/UART2_TX
  @{ */
#define BOARD_DEBUG_UART_TX_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_DEBUG_UART_TX_PIN 16U    /*!<@brief PORTE pin index: 16 */
                                       /* @} */

/*! @name PORTE17 (coord F5), J34[2]/U6[2]/UART2_RX
  @{ */
#define BOARD_DEBUG_UART_RX_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_DEBUG_UART_RX_PIN 17U    /*!<@brief PORTE pin index: 17 */
                                       /* @} */

/*! @name PORTA9 (coord K10), J26[A11]/J29[9]/SD_DETECT
  @{ */
#define BOARD_SDHC_CD_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define BOARD_SDHC_CD_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_SDHC_CD_PIN 9U     /*!<@brief PORTA pin index: 9 */
                                 /* @} */

/*! @name PORTE0 (coord A1), J26[B22]/J29[8]/SDHC0_D1
  @{ */
#define BOARD_SDHC_D1_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_SDHC_D1_PIN 0U     /*!<@brief PORTE pin index: 0 */
                                 /* @} */

/*! @name PORTE1 (coord B1), J26[B11]/J29[7]/SDHC0_D0/SPI1_SOUT
  @{ */
#define BOARD_SDHC_D0_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_SDHC_D0_PIN 1U     /*!<@brief PORTE pin index: 1 */
                                 /* @} */

/*! @name PORTE2 (coord C1), J26[B7]/J29[5]/SDHC0_DCLK/SPI1_SCK
  @{ */
#define BOARD_SDHC_DCLK_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_SDHC_DCLK_PIN 2U     /*!<@brief PORTE pin index: 2 */
                                   /* @} */

/*! @name PORTE3 (coord D1), J26[B10]/J29[3]/SDHC0_CMD/SPI1_SIN
  @{ */
#define BOARD_SDHC_CMD_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_SDHC_CMD_PIN 3U     /*!<@brief PORTE pin index: 3 */
                                  /* @} */

/*! @name PORTE4 (coord E1), J26[B9]/J29[2]/SDHC0_D3/SPI1_PCS0
  @{ */
#define BOARD_SDHC_D3_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_SDHC_D3_PIN 4U     /*!<@brief PORTE pin index: 4 */
                                 /* @} */

/*! @name PORTE5 (coord D2), J26[A10]/J29[1]/SDHC0_D2
  @{ */
#define BOARD_SDHC_D2_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_SDHC_D2_PIN 5U     /*!<@brief PORTE pin index: 5 */
                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTE18 (coord F6), J12[4]/J26[A8]/U15[6]/I2C0_SDA
  @{ */
#define BOARD_I2C_CONFIGUREPINS_ACCEL_I2C_SDA_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_I2C_CONFIGUREPINS_ACCEL_I2C_SDA_PIN 18U    /*!<@brief PORTE pin index: 18 */
                                                         /* @} */

/*! @name PORTE19 (coord F7), J12[3]/J26[A7]/U15[4]/I2C0_SCL
  @{ */
#define BOARD_I2C_CONFIGUREPINS_ACCEL_I2C_SCL_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_I2C_CONFIGUREPINS_ACCEL_I2C_SCL_PIN 19U    /*!<@brief PORTE pin index: 19 */
                                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_I2C_ConfigurePins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
